In [12]:
from env import codeup_db

ImportError: cannot import name 'codeup_db' from 'env' (/Users/aleph/codeup-data-science/numpy-pandas-visualization-exercises/env.py)

In [6]:
from env import get_db_codeup

In [8]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker

In [11]:
import mysql.connector

In [15]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50')

TypeError: read_sql() missing 1 required positional argument: 'con'

In [16]:
import mysql.connector as connection
import pandas as pd

In [18]:
import sqlalchemy as db

In [20]:
from sqlalchemy import create_engine

In [25]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', db_con)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [28]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau